import AuthenticatedLayout from '@/Layouts/AuthenticatedLayout';
import {Head} from '@inertiajs/react';

export default function Dashboard({auth}) {
    return (
        <AuthenticatedLayout
            user={auth.user}
            header={<h2 className="font-semibold text-xl text-gray-800 leading-tight">Зроби щось корисне для себе та
                країни сьогодні!</h2>}
        >
            <Head title="Dashboard"/>

            <div className="py-12">
                <div className="max-w-7xl mx-auto sm:px-6 lg:px-8">
                    <div className="bg-white overflow-hidden shadow-sm sm:rounded-lg">
                        <div className="p-6 text-gray-900 fill-sky-950 lead bg-cyan-300"> Що таке електронна петиція і
                            чи можна понести
                            відповідальність за її зміст
                        </div>
                    </div>
                    <div className='fw-bold pt-10 pl-1.5  mt-4 text-center text-bg-secondary'>Для того щоб звернути увагу
                        суспільства чи
                        органів державної влади на існуючу
                        проблему в соціальній, політичній, економічній чи будь-якій іншій сфері життя країни громадяни
                        можуть подати електронну петицію через офіційний веб-сайт органу, якому вона адресована.
                        Загалом, це один з найбільш ефективних способів комунікації українців з владою, особливо в
                        період воєнного стану, коли кількість питань, які потребують нагального вирішення постійно
                        зростає. На сьогоднішній день, лише до Кабінету міністрів України подано 140 петицій, на які
                        зараз триває збір підписів. Отож, що таке електронна петиція і яким чином її можна подати?
                    </div>

                    <h2 className='h2 mt-10 mb-10 text-success'>Що таке електрона петиція</h2>
                    <div className='bg-gray-100 '>
                        Електронна петиція — це особлива форма колективного звернення громадян до Президента України,
                        Верховної Ради України, Кабінету Міністрів України, органу місцевого самоврядування, яке
                        обов’язкове до розгляду за умови набрання необхідної кількості голосів.
                        <br/><br/>
                        Право направляти індивідуальні чи колективні письмові звернення або особисто звертатися до
                        органів державної влади чи органів місцевого самоврядування українцям гарантує ст.40 Конституції
                        України. Практичну реалізацію цього права забезпечує Закон України “Про звернення громадян”,
                        який і дає визначення поняттю «електоронна петиція».
                    </div>

                    <br/><br/>
                    <div>
                        В електронній петиції має бути викладено суть звернення, зазначено прізвище, ім’я, по батькові
                        автора (ініціатора) електронної петиції, адресу електронної пошти.
                        <br/><br/>
                        Важливо, що ця форма звернення не може містити заклики до повалення конституційного ладу,
                        порушення територіальної цілісності України, пропаганду війни, насильства, жорстокості,
                        розпалювання міжетнічної, расової, релігійної ворожнечі, заклики до вчинення терористичних
                        актів, посягання на права і свободи людини.
                    </div>
                    <h2 className='h2 mt-10 mb-10 text-success'>Порядок подання електронної петиції.</h2>
                    <div>
                        Для подання електронної петиції до Президента України, Верховної Ради України, Кабінету
                        Міністрів України, органу місцевого самоврядування необхідно заповнити спеціальну форму на
                        офіційному веб-сайті органу, якому вона адресована, або веб-сайті громадського об’єднання, яке
                        здійснює збір підписів на підтримку електронних петицій, та розміщує текст електронної петиції.
                        При цьому варто звернути увагу, щоб зазначена в зверненні тема входила до повноваження того
                        органу, до якого направляється.
                        <br/><br/>
                        Створена петиція, у випадку її відповідності встановленим нормам, оприлюднюється на офіційному
                        веб-сайті протягом двох робочих днів з дня надсилання її автором. День її публікації є датою
                        початку збору підписів на її підтримку. А у випадку невідповідності – оприлюднення не
                        відбувається, про що автора інформують не пізніше строку, встановленого для оприлюднення.
                        <br/><br/>
                        Електронні петиції, що адресовані Президенту України, Верховній Раді України, Кабінету Міністрів
                        України, розглядаються у особливому порядку за умови збору на їх підтримку не менш як 25000
                        підписів громадян протягом не більше трьох місяців з дня оприлюднення петиції. Вимоги до
                        кількості підписів громадян на підтримку електронної петиції до органу місцевого самоврядування
                        та строку збору підписів визначаються статутом територіальної громади. Якщо петиція не набрала
                        необхідної кількості підписів, її розглядають в порядку, встановленому законом для звичайних
                        звернень громадян.
                        <br/><br/>
                        Законом України «Про звернення громадян» встановлено принципи, які полягають в тому, що
                        відповідні органи державної влади, органи місцевого самоврядування та громадські об’єднання під
                        час збору підписів на підтримку електронної петиції зобов’язані забезпечити:

                        <ul className="list-group list-group-flush mt-6">
                            <li className="list-group-item">безоплатність доступу та користування
                                інформаційно-телекомунікаційною системою, за допомогою якої здійснюється збір підписів;
                            </li>
                            <li className="list-group-item">електронну реєстрацію громадян для підписання петиції;</li>
                            <li className="list-group-item">недопущення автоматичного введення інформації, у тому числі
                                підписання електронної петиції, без участі громадянина;
                            </li>
                            <li className="list-group-item">фіксацію дати і часу оприлюднення електронної петиції та
                                підписання її громадянином.
                            </li>
                        </ul>
                    </div>


                    <h2 className='h2 mt-10 mb-10 text-success'>Порядок розгляду електронної петиції.</h2>
                    <div>
                        Розгляд електронної петиції здійснюється невідкладно, але не пізніше десяти робочих днів з дня
                        оприлюднення інформації про початок її розгляду.
                        <br/><br/>
                        Інформація про початок розгляду публікується не пізніш як через три робочі дні після набрання
                        необхідної кількості підписів на підтримку петиції, а в разі отримання електронної петиції від
                        громадського об’єднання – не пізніш як через два робочі дні після отримання такої петиції.
                        <br/><br/>
                        Якщо електронна петиція містить клопотання про її розгляд на парламентських слуханнях у
                        Верховній Раді України або громадських слуханнях відповідної територіальної громади, автор
                        (ініціатор) петиції має право представити електронну петицію на таких слуханнях. У такому разі
                        строк розгляду електронної петиції продовжується на строк, необхідний для проведення відповідних
                        слухань.
                        <br/><br/>
                        Відповідь на електронну петицію оприлюднюється на офіційному веб-сайті та надсилається автору у
                        письмовому вигляді не пізніше наступного робочого дня після закінчення її розгляду. У ній
                        повідомляється про результати розгляду порушених у ній питань із відповідним обґрунтуванням.
                        <br/><br/>
                        У разі визнання за доцільне викладені в електронній петиції пропозиції можуть реалізовуватися
                        органом, якому вона адресована, шляхом прийняття з питань, віднесених до його компетенції,
                        відповідного рішення.
                    </div>

                    <h2 className='h2 mt-10 mb-10 text-success'>Відповідальність за зміст електронної петиції</h2>
                    <div>
                        Відповідальність за зміст електронної петиції несе автор (ініціатор) електронної петиції.
                        <br/><br/>
                        Згідно статті 26 Закону України «Про звернення громадян» подання громадянином звернення, яке
                        містить наклеп і образи, дискредитацію органів державної влади, органів місцевого
                        самоврядування, об’єднань громадян та їхніх посадових осіб, керівників та інших посадових осіб
                        підприємств, установ і організацій незалежно від форм власності, заклики до розпалювання
                        національної, расової, релігійної ворожнечі та інших дій, тягне за собою відповідальність,
                        передбачену чинним законодавством.
                        <br/><br/>
                        Консультацію підготував заступник начальника відділу організації надання безоплатної вторинної
                        правової допомоги Регіонального центру з надання безоплатної вторинної правової у місті Києві
                        Кирило Валько.
                    </div>
<br/><br/>
                    <a href="/posts" className="btn btn-success">Створити петицію</a><br/>
                    {/*<a href="/posts/info" className="btn btn-success">Переглянути петицію</a>*/}
                </div>
            </div>
        </AuthenticatedLayout>
    );
}
